# DuplicateTypeName Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..FamilyFailures..::..DuplicateTypeName Property
BuiltInFailures..::..FamilyFailures Class See Also
---
"Ignoring attempt to add family type '%1!s!' for a second time."
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId DuplicateTypeName { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property DuplicateTypeName As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ DuplicateTypeName {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..FamilyFailures Class
Autodesk.Revit.DB Namespace